"""
组包(Packing)：将多个值合并金一个容器
解包(Unpacking)：将容器解开将其中的元素成独立的元素，分别赋值给多个变量

"""
# 元组：组包——解包
# 定义元组
tup01 = (1, 2, 3, 4, 5, 6)
tup02 = 1, 2, 3, 4, 5, 6, 9, 10, 15, 26, 33  # todo:经典元组组包
print(tup01)
print(tup02)

# 基础解包 todo：将容器解开将其中的元素成独立的元素，分别赋值给多个变量
# todo:需要保证变量数和容器中的元素书一致,否则会报错
a, b, c, d, e, f = tup01
print("各个变量的值分别是：", a, b, c, d, e, f)

print("===================================")
# 扩展解包 todo：语法(*)
# *前面个的变量名：依次接受容器中的元素
# *变量名：接受剩余元素，将其接收后生成一个列表
# *变量名后面的变量：依次接受剩余的元素
x, x1, x2, *y, z, z2 = tup02

# *前面变量的值基类型
print("*前面变量的值依次是", x, x1, x2)
print("*前面变量的值类型是：", type(x2))

# *变量的值基类型
print("*变量的值是：", y)
print("*变量的值类型是：", type(y))
# *变量后面变量的值基类型
print("*变量后面变量的值是", z)
print("变量后面的变量的值类型是：", type(z))
